package com.singerstone.jojo.dajiang2024;

public class 无人机1 {
    /**
     * 小C开发了一种新型的无人机机场系统。每个机场能够容纳最多15架无人机，并且每个机场都有唯一的编号。无人机每次起飞或降落，
     * 调度中心都会记录对应的机场编号。在某个特定时刻，所有的机场都是空的。从那个时刻开始，
     * 调度中心记录了一段时间内所有起飞和降落无人机的机场编号。现在小C想知道在这段时间后，
     * 每个机场的无人机数量分布情况，即存放飞机数量为1到15的机场各有多少台？机场编号最大为2^20,飞机起飞降落架次最大为1.8*10^6
     * 输入描述
     * 共4行， 第1行为降落至机场的飞机架次 第2行为按顺序记景有飞机降落的机场编号 第3行为从机场起飞的飞机架次 第4行为按顶序记录有飞机起飞的机场编号
     * 输出描述
     * 依次输出存放飞机数量为1到15的机场各有多少台，中间以空格隔开
     */
    public static void main(String[] args) {

    }
}
